# 1. Напишите программу, которая определит позицию второго вхождения строки в 
#     списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

list_1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
list_2 = ["йцу"]
pos=0
for i in range (len(list_1)-1):
    string1 = list_1[i]
    string2 = list_2[0]
    for j in range (len(string1) - len(string2) + 1):
        if string2 in string1[j:j+len(string2)]:
            result += 1
    print(string1)
    print(string2)
            # pos +=1 
# print(pos)



