# 1. Напишите программу, которая определит позицию второго вхождения строки в 
#     списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1

list_1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
list_2 = ["йцу"]
pos=0
for i in range (len(list_1)-1):
    lenght = len(list_1[i])-len(list_2)
    for j in range (lenght):
        if list_2 in list_1[i:]:
            pos +=1 
print(pos)



