# 1:43
# Создать информационную систему позволяющую работать
# с сотрудниками некой компании \ студентами вуза \ 
# учениками школы

# Функции:
# 1.Меню
# 2.База пользователя(login; password ; surname ; name ; status; discription)
# 3.База предметов(subject_name; login; home_task)
# 4.Таблица студентов
# 5.Интерфейс студента
# 6.Интерфейс препода


# Интерфейс студента: 
# Выйти
# Спроросить предмет


# Интерфейс препода:
# Выйти
# 1.Спросить группу
# 2.Спросить предмет
# 3.Добавить \ изменить ДЗ

# Меню:
# Авторизация(data read) > Студент / преподаватель > Открыть соответствующий интерфейс > Пользователь не найден

# Базы:
# 1.Студенты
# 2.Предметы
# 3.Оценки

# Модуль:
# 1 Интерфейс
# 2 Data read
# 3 Data write
# 4 Data input
